# GetMaterialGUID Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetMaterialGUID Method
FabricationConfiguration Class See Also
---
Gets the material GUID by its identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public Guid GetMaterialGUID(
	int materialId
)
```

Visual Basic
---
```text
Public Function GetMaterialGUID ( _
	materialId As Integer _
) As Guid
```

Visual C++
---
```text
public:
Guid GetMaterialGUID(
	int materialId
)
```

# ### Parameters
materialId
    Type: System..::..Int32 The material identifier.
# ### Return Value
The material GUID. Returns empty GUID if not found.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace